; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite6 - satellite
	instrument9 - instrument
	instrument10 - instrument
	infrared1 - mode
	thermograph0 - mode
	Star5 - direction
	Star4 - direction
	Star0 - direction
	Star3 - direction
	GroundStation1 - direction
	Star2 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star4)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
	(supports instrument7 thermograph0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 infrared1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star3)
	(on_board instrument7 satellite5)
	(on_board instrument8 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon6)
	(supports instrument9 infrared1)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 infrared1)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star2)
	(on_board instrument9 satellite6)
	(on_board instrument10 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star0)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 Star2)
	(pointing satellite5 Star9)
	(pointing satellite6 Star9)
	(have_image Phenomenon6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Planet8 infrared1)
	(have_image Star9 infrared1)
	(have_image Planet10 thermograph0)
))

)

; plan
1. (turn_to satellite6 star9 star0)
   deleted: (pointing satellite6 star0)
   added: (pointing satellite6 star9)
   goals met: 1 of 9
2. (turn_to satellite5 groundstation1 phenomenon6)
   deleted: (pointing satellite5 phenomenon6)
   added: (pointing satellite5 groundstation1)
   goals met: 1 of 9
3. (switch_on instrument7 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument7)
   goals met: 1 of 9
4. (calibrate satellite5 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 1 of 9
5. (turn_to satellite5 phenomenon7 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 phenomenon7)
   goals met: 1 of 9
6. (take_image satellite5 phenomenon7 instrument7 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 2 of 9
7. (turn_to satellite5 phenomenon6 phenomenon7)
   deleted: (pointing satellite5 phenomenon7)
   added: (pointing satellite5 phenomenon6)
   goals met: 2 of 9
8. (turn_to satellite1 star2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star2)
   goals met: 3 of 9
9. (turn_to satellite0 groundstation1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 9
10. (take_image satellite5 phenomenon6 instrument7 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 5 of 9
11. (turn_to satellite5 planet10 phenomenon6)
   deleted: (pointing satellite5 phenomenon6)
   added: (pointing satellite5 planet10)
   goals met: 5 of 9
12. (take_image satellite5 planet10 instrument7 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 6 of 9
13. (turn_to satellite5 planet8 planet10)
   deleted: (pointing satellite5 planet10)
   added: (pointing satellite5 planet8)
   goals met: 6 of 9
14. (take_image satellite5 planet8 instrument7 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 7 of 9
15. (turn_to satellite5 star9 planet8)
   deleted: (pointing satellite5 planet8)
   added: (pointing satellite5 star9)
   goals met: 8 of 9
16. (take_image satellite5 star9 instrument7 infrared1)
   added: (have_image star9 infrared1)
   goals met: 9 of 9
